Tekla Open API Reference for Tekla Structures 2025
ClashChekerEvent Class
 The ClashChekerEvent class contains methods related to clash check events.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.ClashChecker.ClashChekerEvent
 Namespace: Tekla.Structures.Model.ClashChecker
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class ClashChekerEvent
<SerializableAttribute>
Public NotInheritable Class ClashChekerEvent
The ClashChekerEvent type exposes the following members.
Methods
Name | Description
GetClashCheckHandler
 Returns a new clash check handler.
Top
See Also
Reference
Tekla.Structures.Model.ClashChecker Namespace